Repository: Polymaker/ldd-modder
Catalog: Sources/LDDModder.BrickEditor/UI/Windows/ExportPartModelWindow.*.resx
Languages: fr

# $this.Text
source: Export LDD Model
fr: Exporter un modèle LDD

# ChkAltMeshes.Text
source: Include alt. meshes
fr: Inclure les modèles alternatifs

# ChkBones.Text
source: Include bones
fr: Inclure

# ChkCollisions.Text
source: Include collisions
fr: Inclure les collisions

# ChkConnections.Text
source: Include connections
fr: Inclure les connexions

# CurrentProjectRb.Text
source: Current Project
fr: Projet en cours

# ExportButton.Text
source: Export
fr: Exporter

# groupBox1.Text
source: 3 - Export format
fr: 3 - Format d'exportation

# RbAdvancedExport.Text
source: Advanced mode
fr: Mode avancé

# RbSimpleExport.Text
source: Part model only
fr: Modèle seulement

# ReturnButton.Text
source: Back
fr: Retour

# Step1GroupBox.Text
source: 1 - Part to export
fr: 1 - Pièce à exporter

# Step2GroupBox.Text
source: 2 - Export options
fr: 2 - Options

# SelectPartRb.Text
source: Select part
fr: Sélectionner

# PartNameLabel.Text
source: <Part Name>
fr: <Nom de la pièce>

# ChkRoundEdge.Text
source: RoundEdge data (UV maps)
fr: Données de contour (UVs)
