Repository: Polymaker/ldd-modder
Catalog: Sources/LDDModder.BrickEditor/Resources/ModelLocalizations.*.resx
Languages: fr

# Label_Decoration
source: Decoration
fr: Décoration

# Label_Part
source: Part
fr: Pièce

# Label_Brick
source: Brick
fr: Brique

# Label_Connections
source: Connections
fr: Connexions

# Label_MainSurface
source: Main surface
fr: Surface principale

# Label_DecorationSurface
source: Decoration surface
fr: Surface de décoration

# Label_Model
source: Model
fr: Modèle

# Label_Component
source: Component
fr: Composant

# Label_NewPartProject
source: New part
fr: Nouvelle pièce

# Label_PartProjectName
source: Part %partid%
fr: Pièce %partid%

# Label_Models
source: Models
fr: Modèles

# Label_FemaleStuds
source: Studs (female)
fr: Studs (femelle)

# Label_FemaleStud
source: Female stud
fr: Stud femelle

# Label_Geometry
source: Geometry
fr: Géometrie

# Label_Mesh
source: Mesh
fr: Géometrie

# Label_AlternateMeshes
source: Alternate model
fr: Modèle alternatif

# Label_DecorationSurfaceNumber
source: Decoration surface {0}
fr: Surface de décoration {0}

# Label_NoActiveProject
source: No active project
fr: Aucun projet actif

# ConnectorType_Axel
source: Cylindrical (bars & technic)
fr: Cylindrique (barres & technic)

# ConnectorType_Hinge
source: Hinge
fr: Charnière

# ConnectorType_Rail
source: Train rails
fr: Rails de train

# ConnectorType_Gear
source: Gear
fr: Engrenage

# ConnectorType_Fixed
source: Fixed coupling (tires, doors, etc.)
fr: Couplage fixe (pneus, portes, etc.)

# ConnectorType_Custom2DField
source: Studs (bricks)
fr: Studs (briques)

# ConnectorType_Slider
source: Slider
fr: Glisière

# ConnectorType_Ball
source: Ball joint & misc
fr: Joint à rotule & divers

# CollisionType_Sphere
source: Sphere
fr: Sphère

# CollisionType_Box
source: Box
fr: Boîte

# Label_CollisionBoxes
source: Boxes
fr: Boîtes

# Label_CollisionSpheres
source: Spheres
fr: Sphères

# NodeRangeFormat1
source: {0} to {1}
fr: {0} à {1}

# ModelComponentType_Part
source: Part model
fr: Modèle

# ModelComponentType_FemaleStud
source: Stud (female)
fr: Stud (femelle)

# ModelComponentType_BrickTube
source: Brick tube
fr: Tube intérieur

# Label_FixedConnectors
source: Fixed conn.
fr: Conn. fixes

# Label_GearConnectors
source: Gears
fr: Engrenages

# Label_HingeConnectors
source: Hinges
fr: Charnières

# Label_SliderConnectors
source: Sliders
fr: Glisières

# Label_BallConnectors
source: Balls
fr: Joints

# Label_AxelConnectors
source: Cylindrical conn.
fr: Conn. cylindriques

# Label_BrickTubeComponents
source: Brick tubes
fr: Tube intérieurs

# Label_MaleStudComponents
source: Male studs
fr: Studs mâles

# Label_FemaleStudComponents
source: Female studs
fr: Studs femelles

# Label_PartComponents
source: Part models
fr: Modèles de pièce

# Label_DefaultMeshes
source: Normal model
fr: Modèle normal

# Label_Project
source: Project
fr: Projet

# PROJECT_NO_CONNECTIONS
source: There is no connection defined. The part will not connect with anything.
fr: Aucune connexion n'est définie. La pièce ne se connectera à rien.

# PROJECT_NO_SURFACES
source: The part must have at least one surface.
fr: La pièce doit avoir au moins une surface.

# PROJECT_NO_COLLISIONS
source: There is no collision defined.
fr: Aucune collision n'est définie.

# PROJECT_NO_BONES
source: There is no bone defined. The part cannot be flexible.
fr: Il n'y a pas d'armature de définie. La pièce ne peut pas être flexible.

# PROJECT_NO_ISSUES
source: No configuration problem found.
fr: Aucun problème de configuration trouvé.

# SURFACE_NO_MODELS
source: The surface {0} does not contain any model.
fr: La surface {0} ne contient aucun modèle.

# SURFACE_NO_TEXTURED_MODEL
source: The surface {0} has some models without texture coordinates.
fr: La surface {0} a quelques modèles sans coordonnées de texture.

# PART_EMPTY_DESCRIPTION
source: The part description is empty.
fr: La description de la pièce est vide.

# PART_EMPTY_PART_ID
source: You must enter a part ID.
fr: Vous devez entrer un numéro de pièce.

# PART_NO_BOUNDING
source: The part bounding box is not defined.
fr: Le cadre de délimitation de la pièce n'est pas défini.

# PART_NO_GEOMETRYBOUNDING
source: The geometry bounding box is not defined.
fr: Le cadre de délimitation de la géométrie n'est pas défini.

# MODEL_STUDS_NOT_DEFINED
source: The model does not reference any stud.
fr: Le modèle ne fait référence à aucun Stud.

# STUD_CONNECTION_NOT_DEFINED
source: The connection is not set or invalid.
fr: La connexion n'est pas définie ou invalide.

# STUD_CONNECTION_FIELD_NOT_DEFINED
source: The referenced stud is not defined.
fr: Le Stud référencé n'est pas défini.

# STUD_CONNECTION_FIELD_INVALID
source: The referenced stud is invalid.
fr: Le Stud référencé n'est pas valide.

# MODEL_STUDS_NOT_DEFINED_ALT
source: The model does not reference any stud. Therefore the alternate model will never be displayed.
fr: Le modèle ne fait référence à aucun Stud. Par conséquent, le modèle alternatif ne sera jamais affiché.

# Label_Bones
source: Bones
fr: Armature

# Label_Connection
source: Connection
fr: Connexion

# Label_Bone
source: Bone
fr: Jointure

# BONES_ID_GAP
source: Bone ID numbering gap (missing ID: {0})
fr: Écart de numérotation d'armatures (ID manquant: {0})

# BONES_DUPLICATE_IDS
source: Duplicate Bone IDs ({0})
fr: Doublons d'identifiants d'os ({0})

# BONE_NO_BOUNDING
source: Bounding box is not defined.
fr: Le cadre de délimitation n'est pas défini.

# BONE_NOT_LINKED
source: Bone "{name}" is not linked.
fr: L'os "{name}" n'est pas lié.

# BONE_CONNECTION_NOT_SET
source: 'Flex' connections are not defined.
fr: Les connexions 'Flex' ne sont pas définies.

# BONE_MULTIPLE_LINKS
source: Bone "{name}" is referenced by multiple bones.
fr: L'os "{nom}" est référencé par plusieurs os.

# Label_ClonePatterns
source: Clone patterns
fr: Modèles de clonage

# ClonePatternType_Mirror
source: Mirror
fr: Miroir

# ClonePatternType_Linear
source: Linear repetition
fr: Répétition linéaire

# ClonePatternType_Circular
source: Circular repetition
fr: Répétition circulaire
